<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for MMLH</string>
    <key>Identifier</key>
    <string>com.github.waddlaw.download.mmlh</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>mmlh</string>
        <key>BRANCH</key>
        <string>master</string>
        <key>URL</key>
        <string>https://github.com/waddlaw/makeMistakesToLearnHaskell/master</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.0.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/mmlh.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>